---
type: TemperatureRatingTypeSet
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 10
tags: [revit-api, class]
---

# TemperatureRatingTypeSet

`Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | TemperatureRatingTypeSet | — | `public TemperatureRatingTypeSet ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( TemperatureRatingType item )` |
| Method | Erase | — | `public virtual int Erase ( TemperatureRatingType item )` |
| Method | ForwardIterator | — | `public virtual TemperatureRatingTypeSetIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( TemperatureRatingType item )` |
| Method | ReverseIterator | — | `public virtual TemperatureRatingTypeSetIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |